
/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "File.h"


/*----------------------------------------------*
 * 宏定义                                 *
 *----------------------------------------------*/
/*----------------------------------------------*
 * 枚举定义                            *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 结构体定义                              *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                       *
 *----------------------------------------------*/
int DEFAULT_FILE_BUFFER = 4096;

/**
*@brief 获取对指定文件路径 pPath 进行读写操作时的最佳缓冲区长度（由于磁盘块与具体的文件系统有关，因此必须指定文件路径）。
*
*
*@param const char *pPath
*
*@return int 
*
*@author Litost_Cheng
*@date 2019年1月21日
*@note 新生成函数
*
*/
int GetBestFileBuf(const char *pPath)
{
	
	int nRst = DEFAULT_FILE_BUFFER;
	
	struct stat stStat;
	do
	{
		
		if (!ErrMsgRet((NULL != pPath), "NULL == pPath"))
		{
			break;
		}

		
        if (!ErrMsgRet(0 == stat(pPath,  &stStat), "Get the file [%s] info failed", pPath))
		{
			break;
		}

        if ( ErrMsgRet(S_ISREG(stStat.st_mode), "pPath [%s] is not a file\n", pPath))
		{
		    break;
		}

		nRst = stStat.st_blksize;

		
	}
	while(0);
	return nRst;
	
}
